fe40/tutorials/rheoInterFoam/damBreak/Newtonian/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phase1
{
      parameters
       {		        
         type            Newtonian;
         rho             rho [1 -3 0 0 0 0 0] 1000;
         eta             eta [1 -1 -1 0 0 0 0] 0.001;  
       }
}
phase2
{
     parameters
       {		        
         type            Newtonian;
         rho             rho [1 -3 0 0 0 0 0] 1;
         eta             eta [1 -1 -1 0 0 0 0] 1.48e-5;  
       }
}

passiveScalarProperties
{

                solvePassiveScalar   off;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.07;

// ************************************************************************* //
