fe40/tutorials/rheoInterFoam/damBreak/Newtonian/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         Gauss linear;
 
}

divSchemes
{
    default                  none;
   
    div(rho*phi,U)           Gauss limitedLinearV 1;
    div(Sum(tau))            Gauss linear;
    div(phi,alpha)           Gauss vanLeer;
    div(phirb,alpha)         Gauss interfaceCompression;
    div(eta*alpha*dev2(T(gradU)))  Gauss linear;          
}

laplacianSchemes
{
    default                             Gauss linear corrected;
}

interpolationSchemes
{
    default        linear;      
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
